app/Http/Controllers/PostLikeController.php

insert into `likes` (`user_id`, `post_id`, `updated_at`, `created_at`) values (3, 10, '2022-06-03 14:00:34', '2022-06-03 14:00:34')
---
    public function store(Post $post, Request $request)
    {
        //dd($post->likedBy($request->user())); //boolean

        if($post->likedBy($request->user())){
            return response(null, 409);
        }

        $post->likes()->create([
            'user_id'=> $request->user()->id,
        ]);