app/Http/Controllers/PostController.php

    public function index()
    {
       // $posts= Post::get();

        $posts = Post::latest()->with(['user', 'likes'])->paginate(20);
---
select * from `likes` where `likes`.`post_id` in (2, 5, 6, 8, 10)
select * from `posts` order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (3, 4)
select count(*) as aggregate from `posts`