app/Http/Controllers/UserPostController.php

    public function index(User $user)
    {
        $posts = $user->posts()->with(['user', 'likes'])->paginate(20);
---
select * from `likes` where `likes`.`post_id` in (2, 8, 10)
select * from `posts` where `posts`.`user_id` = 3 and `posts`.`user_id` is not null limit 20 offset 0
select * from `users` where `users`.`id` in (3)
select count(*) as aggregate from `posts` where `posts`.`user_id` = 3 and `posts`.`user_id` is not null